TASK
Directory used for annotations : img/cropped/RGB/
Classification type : Face
Number of classes : 2
Bands used : [22, 53, 89]
Number of bands : 3


MODEL'S HYPERPARAMETERS
Structure : 
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN_2                                    [64, 2]                   --
├─Conv2d: 1-1                            [64, 8, 198, 198]         1,184
├─ReLU: 1-2                              [64, 8, 198, 198]         --
├─MaxPool2d: 1-3                         [64, 8, 66, 66]           --
├─Conv2d: 1-4                            [64, 16, 64, 64]          3,216
├─ReLU: 1-5                              [64, 16, 64, 64]          --
├─MaxPool2d: 1-6                         [64, 16, 32, 32]          --
├─Conv2d: 1-7                            [64, 32, 32, 32]          4,640
├─ReLU: 1-8                              [64, 32, 32, 32]          --
├─MaxPool2d: 1-9                         [64, 32, 16, 16]          --
├─Conv2d: 1-10                           [64, 64, 16, 16]          18,496
├─ReLU: 1-11                             [64, 64, 16, 16]          --
├─MaxPool2d: 1-12                        [64, 64, 8, 8]            --
├─Conv2d: 1-13                           [64, 128, 8, 8]           73,856
├─ReLU: 1-14                             [64, 128, 8, 8]           --
├─MaxPool2d: 1-15                        [64, 128, 4, 4]           --
├─Flatten: 1-16                          [64, 2048]                --
├─Linear: 1-17                           [64, 100]                 204,900
├─Dropout: 1-18                          [64, 100]                 --
├─ReLU: 1-19                             [64, 100]                 --
├─Linear: 1-20                           [64, 20]                  2,020
├─ReLU: 1-21                             [64, 20]                  --
├─Linear: 1-22                           [64, 2]                   42
├─Softmax: 1-23                          [64, 2]                   --
==========================================================================================
Total params: 308,354
Trainable params: 308,354
Non-trainable params: 0
Total mult-adds (G): 4.74
==========================================================================================
Input size (MB): 30.72
Forward/backward pass size (MB): 223.56
Params size (MB): 1.23
Estimated Total Size (MB): 255.51
==========================================================================================
Number of epochs : 80
Learning rate : 0.0001
Batch size : 64
Classes' weights in the loss : [2.0, 2.0]