TASK
Directory used for annotations : img/cropped/RGB/
Classification type : Face
Number of classes : 3
Bands used : [22, 53, 89]
Number of bands : 3


MODEL'S HYPERPARAMETERS
Structure : 
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN_3                                    [32, 3]                   --
├─Conv2d: 1-1                            [32, 32, 198, 198]        4,736
├─ReLU: 1-2                              [32, 32, 198, 198]        --
├─MaxPool2d: 1-3                         [32, 32, 66, 66]          --
├─Conv2d: 1-4                            [32, 64, 64, 64]          51,264
├─ReLU: 1-5                              [32, 64, 64, 64]          --
├─MaxPool2d: 1-6                         [32, 64, 32, 32]          --
├─Conv2d: 1-7                            [32, 128, 32, 32]         73,856
├─ReLU: 1-8                              [32, 128, 32, 32]         --
├─MaxPool2d: 1-9                         [32, 128, 16, 16]         --
├─Conv2d: 1-10                           [32, 256, 16, 16]         295,168
├─ReLU: 1-11                             [32, 256, 16, 16]         --
├─MaxPool2d: 1-12                        [32, 256, 8, 8]           --
├─Conv2d: 1-13                           [32, 256, 8, 8]           590,080
├─ReLU: 1-14                             [32, 256, 8, 8]           --
├─MaxPool2d: 1-15                        [32, 256, 4, 4]           --
├─Flatten: 1-16                          [32, 4096]                --
├─Linear: 1-17                           [32, 100]                 409,700
├─Dropout: 1-18                          [32, 100]                 --
├─ReLU: 1-19                             [32, 100]                 --
├─Linear: 1-20                           [32, 30]                  3,030
├─ReLU: 1-21                             [32, 30]                  --
├─Linear: 1-22                           [32, 3]                   93
├─Softmax: 1-23                          [32, 3]                   --
==========================================================================================
Total params: 1,427,927
Trainable params: 1,427,927
Non-trainable params: 0
Total mult-adds (G): 18.72
==========================================================================================
Input size (MB): 15.36
Forward/backward pass size (MB): 442.83
Params size (MB): 5.71
Estimated Total Size (MB): 463.90
==========================================================================================
Number of epochs : 80
Learning rate : 0.0001
Batch size : 32
Classes' weights in the loss : [2.0, 2.0, 2.0]