TASK
Directory used for annotations : img/cropped/RGB/
Classification type : Face
Number of classes : 2
Bands used : [22, 53, 89]
Number of bands : 3


MODEL'S HYPERPARAMETERS
Structure : 
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN_3                                    [64, 2]                   --
├─Conv2d: 1-1                            [64, 32, 198, 198]        4,736
├─ReLU: 1-2                              [64, 32, 198, 198]        --
├─MaxPool2d: 1-3                         [64, 32, 66, 66]          --
├─Conv2d: 1-4                            [64, 64, 64, 64]          51,264
├─ReLU: 1-5                              [64, 64, 64, 64]          --
├─MaxPool2d: 1-6                         [64, 64, 32, 32]          --
├─Conv2d: 1-7                            [64, 128, 32, 32]         73,856
├─ReLU: 1-8                              [64, 128, 32, 32]         --
├─MaxPool2d: 1-9                         [64, 128, 16, 16]         --
├─Conv2d: 1-10                           [64, 256, 16, 16]         295,168
├─ReLU: 1-11                             [64, 256, 16, 16]         --
├─MaxPool2d: 1-12                        [64, 256, 8, 8]           --
├─Conv2d: 1-13                           [64, 256, 8, 8]           590,080
├─ReLU: 1-14                             [64, 256, 8, 8]           --
├─MaxPool2d: 1-15                        [64, 256, 4, 4]           --
├─Flatten: 1-16                          [64, 4096]                --
├─Linear: 1-17                           [64, 100]                 409,700
├─Dropout: 1-18                          [64, 100]                 --
├─ReLU: 1-19                             [64, 100]                 --
├─Linear: 1-20                           [64, 30]                  3,030
├─ReLU: 1-21                             [64, 30]                  --
├─Linear: 1-22                           [64, 2]                   62
├─Softmax: 1-23                          [64, 2]                   --
==========================================================================================
Total params: 1,427,896
Trainable params: 1,427,896
Non-trainable params: 0
Total mult-adds (G): 37.44
==========================================================================================
Input size (MB): 30.72
Forward/backward pass size (MB): 885.66
Params size (MB): 5.71
Estimated Total Size (MB): 922.09
==========================================================================================
Number of epochs : 80
Learning rate : 0.0001
Batch size : 64
Classes' weights in the loss : [2.0, 2.0]