TASK
Directory used for annotations : img/cropped/
Classification type : Face
Number of classes : 2
Bands used : [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215]
Number of bands : 216


MODEL'S HYPERPARAMETERS
Structure : 
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN_1                                    [32, 2]                   --
├─Conv2d: 1-1                            [32, 10, 200, 200]        105,850
├─ReLU: 1-2                              [32, 10, 200, 200]        --
├─MaxPool2d: 1-3                         [32, 10, 100, 100]        --
├─Conv2d: 1-4                            [32, 15, 100, 100]        3,765
├─ReLU: 1-5                              [32, 15, 100, 100]        --
├─MaxPool2d: 1-6                         [32, 15, 50, 50]          --
├─Conv2d: 1-7                            [32, 25, 50, 50]          3,400
├─ReLU: 1-8                              [32, 25, 50, 50]          --
├─MaxPool2d: 1-9                         [32, 25, 25, 25]          --
├─Flatten: 1-10                          [32, 15625]               --
├─Linear: 1-11                           [32, 10]                  156,260
├─Dropout: 1-12                          [32, 10]                  --
├─ReLU: 1-13                             [32, 10]                  --
├─Linear: 1-14                           [32, 2]                   22
├─Softmax: 1-15                          [32, 2]                   --
==========================================================================================
Total params: 269,297
Trainable params: 269,297
Non-trainable params: 0
Total mult-adds (G): 136.97
==========================================================================================
Input size (MB): 1105.92
Forward/backward pass size (MB): 156.80
Params size (MB): 1.08
Estimated Total Size (MB): 1263.80
==========================================================================================
Number of epochs : 80
Learning rate : 0.0001
Batch size : 32
Classes' weights in the loss : [2.0, 2.0]